public class Main {
    public static void main(String[] args) {
        // Задание 1
        System.out.println("Задание 1");
        int age = 21;
        if (age >= 18) {
            System.out.println("Поздравляем! Вы достигли совершеннолетия!");
        }
        if (age < 18) {
            System.out.println("Возраст совершеннолетия еще не наступил, нужно чутка подождать!");
        }
    }
}

